#+Title: Emacs configuration :cat:<<¡VAMOS PERU!>>:pe:
#+Author: vale~

*** indent
   #+BEGIN_SRC emacs-lisp
	 ;;(setq-default tab-always-indent nil)
	 ;; make return key also do indent, globally
	 (setq-default indent-tabs-mode 4)
	 (setq-default tab-width 4)
	 ;;(electric-indent-mode 1)
	 ;;(setq tab-stop-list (number-sequence 2 200 2))
		#+END_SRC

		#+RESULTS:
		: 4

